const ru = {
    location: 'Россия',
    age: 'Лет',
    meBtn: 'Я',
    articlesBtn: 'Статьи',
    contactsBtn: 'Контакты',
    lang: 'язык',
    mainUpdate: '5 апреля 2026',
    articlesCount: 'статей',
    readIn: 'Читать на ',
    footer: 'cделано в 2026 году с ❤ клавиатуры',
    back: 'Назад',
    
    // content

    aboutMe: 'Обо мне.',
    aboutMeContent: 'Мультидисциплинарный разработчик, больше 10 лет изучаю и экспериментирую с технологиями — это моё фулл-тайм хобби которое периодами перерастает в работу. С конца 2025 года изучаю блокчейн технологии и интегрирую Web3 в свои проекты.',

    facts: 'Дополнительные факты.',
    factsContent: 'Увлекаюсь разработкой электроники, пишу статьи на тему технологий и не только, преподавал программирование, с недавнего времени осваиваю видео монтаж и создание 3D моделей в Blender.',

    factsList: [
        '2015: В школе начал верстать, первый проект магазин приложений на полках в стиле IOS 6 iBOOKS.',
        'Первый язык программирования: Action Script 2.0, (язык для Flash игр и интерактивной графики).',
        '2016: Сделал первую браузерную игру на JavaScript и Canvas (в духе Flappy Bird).',
        'После публикации статьи на Habr меня пригласили писать для Hacker.ru (Xakep).',
        '2018: За одну ночь разработал технологию для бизнеса и получил долю в нем.'
    ],

    work: 'Работа.',
    workContent: 'Являюсь действующим фрилансером и открыт к предложениям, партнерству или коллаборации.',

    development: 'Разработка и экспертиза.',
    developmentContent: 'И многое другое.',

    techList: [
        'Веб-приложения: React, Styled-Components, MobX, Express, MongoDB',
        'Браузерные расширения: Manifest v3',
        'Telegram-ботов: Telegraf',
        'Смарт-контракты: Solidity',
        'Десктоп-приложения: Electron',
        'Микроконтроллеры: Arduino',
        'Автоматизацию: Puppeteer / BAS'
    ],

    contacts: 'Контакты и медиа.',
    contactsContent: 'Раньше всего отвечу в телеграм.'
}

export default ru