const ru = {
    location: 'Россия',
    age: 'Лет',
    meBtn: 'Я',
    articlesBtn: 'Статьи',
    contactsBtn: 'Контакты',
    developerBtn: 'Разработчик',
    closeBtn: 'Закрыть',
    lang: 'язык',
    mainUpdate: '5 апреля 2026',
    stasUpdate: '8 апреля 2026',
    web3Update: '15 апреля 2026',
    articlesCount: 'статей',
    readInBtn: 'Читать на ',
    readBtn: 'Читать',
    launchBtn: 'Запустить',
    footer: 'cделано в 2026 году с ❤ клавиатуры',
    backBtn: 'Назад',
    personalCoin: 'Personal coin',
    in: 'в',
    notify: 'Уведомление',
    selectNetworkForBuyCoins: 'Выберите сеть в которой хотите купить монеты.',
    addNetwork: 'Добавить сеть',
    selectNetworkForImportToWallet: 'Выберите сеть которая будет импортирована в ваш кошелек.',
    manual: 'Инструкция',
    testnetDropCoins: ['Чтобы получить монеты в тестнете', ', нужно отправить в комментарии к посту в телеграм, адрес своего', ' кошелька.'],
    openInTelegram: 'Открыть в telegram',
    airdropSubscribe: ['Чтобы получать ежедневный airdrop', 'нужно быть подписанным на телеграм канал.'],
    email: 'Почта',
    emailAddressCopy: ['Адрес', 'скопирован в буфер обмена.'],
    openInGmail: 'Открыть в Gmail',
    openInMail: 'Открыть в почте',
    reportBug: 'Сообщить о баге',
    contactReportBug: 'Вы можете связаться со мной через один из способов связи.',
    networkAndTokenAddedOk: 'Сеть и монета добавлены в кошелек.',
    networkAndTokenAddedError: 'Сеть и монета не добавлены в кошелек.',
    sendDonateOk: 'Спасибо за донат!',
    sendDonateError: 'Какая-то ошибка, донат не отправлен',
    
    // content

    mainPage: [
        'Обо мне.', 
        'Мультидисциплинарный разработчик, больше 10 лет изучаю и экспериментирую с технологиями — это моё фулл-тайм хобби которое периодами перерастает в работу. С конца 2025 года изучаю блокчейн технологии и интегрирую Web3 в свои проекты.',
        'Дополнительные факты.',
        'Увлекаюсь разработкой электроники, пишу статьи на тему технологий и не только, преподавал программирование, с недавнего времени осваиваю видео монтаж и создание 3D моделей в Blender.',
        [
            '2015: В школе начал верстать, первый проект магазин приложений на полках в стиле IOS 6 iBOOKS.',
            'Первый язык программирования: Action Script 2.0, (язык для Flash игр и интерактивной графики).',
            '2016: Сделал первую браузерную игру на JavaScript и Canvas (в духе Flappy Bird).',
            'После публикации статьи на Habr меня пригласили писать для Hacker.ru (Xakep).',
            '2018: За одну ночь разработал технологию для бизнеса и получил долю в нем.'
        ],
        'Работа.',
        'Являюсь действующим фрилансером и открыт к предложениям, партнерству или коллаборации.',
        'Разработка и экспертиза.',
        'И многое другое.',
        [
            'Веб-приложения: React, Styled-Components, MobX, Express, MongoDB',
            'Браузерные расширения: Manifest v3',
            'Telegram-ботов: Telegraf',
            'Смарт-контракты: Solidity',
            'Десктоп-приложения: Electron',
            'Микроконтроллеры: Arduino',
            'Автоматизацию: Puppeteer / BAS'
        ],
        'Контакты и медиа.',
        'Раньше всего отвечу в телеграм.',
        'Донат.',
        'Вы можете поддержать мою деятельность задонатив в моей монете.'
    ],

    // stas

    stasPage: [
        'Мотивация.', 
        'Одна из целей разработки собственной монеты переосмыслить концепцию мем коинов на примере персонального коина.',
        'Мем-коины функционально ничем не отличаются от другой криптовалюты которую называют альткоинами, мем коин это прежде всего концепция. Как правило, такие токены создаются для «поглощения» информационного шума: они возникают вокруг мемов, хайповых событий, известных личностей или политических процессов и существуют как временный феномен.',
        'Концепция',
        'personal-coin', 
        'подразумевает ассоциацию и неразрывную связь разработчика с монетой.', 
        'В отличие от стандартных мем коинов, $STAS, задумывается как условная единица в моей Web3-экосистеме. Монета будет использоваться в текущих и будущих проектах — приложениях и сервисах, в качестве средства расчета. Это значит что некоторые действия которое вы совершаете в моих,', 
        'DApp', 
        'приложениях запросят у вас оплату в $STAS в каждом случае оплаты я как разработчик получаю минимум', 
        '1 $STAS', 
        'на свой кошелек в качестве комиссии. Таким образом, мои Web3-разработки оказываются напрямую связаны с токеном, формируя единую экосистему и поддерживая меня как разработчика начисляя комссии за использование.',
        'Возможности.', 
        'Другие разработчики также могут использовать мои наработки в своих проектах и принимать оплату в $STAS если это необходимо используя', 
        'stas-pay', 
        'и', 
        'redstone', 
        '. Но могут работать и без использования моненты только на комиссиях сети. Также не обязательно быть разработчиком чтобы принимать оплату в $STAS некоторые мои приложения позволяют зарабатывать монеты пользователям, например ', 
        'Horn', 
        ' — децентрализованная система голосования позволяет создавать платные опросы и зарабатывать на привлеченных голосах. Существующие библиотеки уже поддерживают мультичейн и корректную синхронизацию данных между сетями в рамках одного приложения.',
        'Токеномика.', 
        'Для каждой EVM-сети в которой размещена монета*', 
        'Всего монет:', 
        '382,000,000 $STAS',
        'Распределение:',
        [
            ['Liquidity - ', '~80%'],
            ['Airdrop - ', '~13%'],
            ['Developer - ', '~7%'],
        ],
        'CA.', 
        'Это единый адрес монеты для всех сетей:', 
        '0xD566886eB93500e2BA464bd48c8D5A2556569253'
    ],

    // web3

    web3TestnetPage: [
        'Testnet.', 
        'Новые приложения проходят тестирование в этом разделе после чего перейдут в mainnet и будут использоваться через монету',
        '$STAS'
    ],

    web3MainnetPage: [
        'Mainnet.', 
        'В этом разделе размещены приложения связанные с монетой', 
        '$STAS', 
        'в основной сети.'
    ],

    // apps description

    burnStasCoin: 'Безвозвратное сжигание токенов $STAS',
    payCalc: 'Превое приложение на Solidity, простой калькулятор',
    paintChat: 'Второе приложение на Solidity, позволяет создавать коллективный рисунок и обсуждать его в чате',
    cryptoTarot: 'Блокчейн карты таро, самый точный результаты, имеет три расклада',
    web3Piano: 'Пианино для создания и записи музыки с публикацией в блокчейн',
    horn: 'Простой способ организовать публичное Web3 голосование и получать комиссию в токенах $STAS в качестве партнера за привлеченные голоса.',
    de2fa: 'Децентрализованное хранилище 2FA ключей, защищённых клиентским шифрованием на основе PBKDF2 и Argon2id с AES-GCM, где все данные шифруются и расшифровываются исключительно на стороне пользователя без серверного хранения ключей.'
}

export default ru