[
  {
    "text": "В 18 лет за один день на фрилансе заработал 15 тысяч и на следующий день получил предложение работать за долю в бизнесе, так я <selection>за день получил 50% в бизнесе</selection> и пол года (пока существовал сервис) я получал деньги за доработку софта."
  },
  {
    "text": "Снял <b>первую в мире</b> короткометражу-фильм, в котором поучавствовало <b>36 250 308 emoji</b>, ни один из emoji не пострадал, потерь нет. Посмотреть можно <a href='/project/emoji-bad-apple'>тут</a>."
  },
  {
    "text": "В 2018 году после одной из статей про маленькую плату 7х5см получил сразу два предложения, писать для <b>xakep.ru</b> и запрограммировать <b>целую гостиницу</b> как ту самую плату. Но от первого предложения я отказался на то время по идеалогическим причинам, а второе прложение как-то исчезло само собой не помню после чего или после суммы или после того что я сказал что буду писать потом <b>статью</b> «как это было..»"
  },
  {
    "text": "В начале 2022 года разработал полноценный модуль <a href='/project/radio-station'>радио станции</a> как альтернативу <a href='https://icecast.org/'>Icecast</a>, который на <b>98.2% состоит из JavaScript</b>. И запустил свою радио станцию <a href='/service/radio-boomer-fm'>Radio.Boomer FM</b>."
  },
  {
    "text": "Создал великолепную скульптуру буквально <b>из мусора</b>. Посмотреть можно <a href='/project/N'>тут</a>."
  },
  {
    "text": "Сгенерировал <b>первую в мире</b> статью из видео с YouTube. Посмотреть можно <a href='/project/N'>тут</a>."
  },
  {
    "text": "Зарегистрировал много аккаунтов и случайно <b>запустил с них всех видео-трансляции</b>, затем через 2 дня у <a href='https://chaturbate.com/'>Chaturbate</a> изменилась форма регистрации ¯\\_(ツ)_/¯ После этого многие дрочилы потеряли возможность стримить без верификации по паспорту - не использовал в личных или комерческих целях."
  },
  {
    "text": "В 2016 году разработал <a href='/project/canava'>свой игровой движок</a> на JavaScript и Canvas."
  },
  {
    "text": "Создал программу для конвертации видео по шаблону пикселей вычисляющих цвет и формирущих кадр за кадром массивы цветов для светового шоу. Посмотреть что из этого получилось можно тут: <a href='/project/N'>ссылка на проект</a>."
  },
  {
    "text": "Создал свой <a href='/service/js-vpn-client'>VPN клиент</a> на JavaScript. Используя OpenVPN и Electron."
  },
  {
    "text": "Случайно заметил способ безлимитно использовать <a href='/project/tor-speech'>TTS Google и Яндекса</a> используя внутренний <b>API</b> - не использовал в личных или комерческих целях."
  },
  {
    "text": "Случайно заметил основную уязвимость на сайте <a href='/project/N'>одноразовой почты</a> - не использовал в личных или комерческих целях. Со мной связались владельцы и пригласили на работу ¯\\_(ツ)_/¯"
  },
  {
    "text": "Сделал закрытое <b>API</b> yandex картинок открытыми и доступным для всех - не использовал в личных или комерческих целях."
  },
  {
    "text": "Случайно заметил две уязвимости в расширении Яндекс советника отключающие его на любом сайте и в любом браузере. История гласит что <b>до меня</b> 26 программистов 2 месяца не могли найти как его отключить - не использовал в личных или комерческих целях."
  },
  {
    "text": "Случайно заметил уязвимость в Google переводчике и конечно не использовал ее в личных или комерческих целях."
  }
]
