[
  {
    "image": "/api/images/1638256412121957268.jpg",
    "title": "Сказ о том, как программист скульптуру создавал",
    "description": "Некоторое время назад у меня было совершенно много времени из-за отсутствия дел, как ни странно, я совершенно не знал, чем себя занять и все из-за того что, не мог программировать — заниматься любимым делом.",
    "link": ["https://pikabu.ru/story/skaz_o_tom_kak_programmist_skulpturu_sozdaval_8653314", "Читать на Pikabu"],
    "tags": ["Искусство", "Pikabu", "Ручная работа"]
  },
  {
    "image": "/api/images/267b4555da804c803c0da8817e87cf0b.jpg",
    "title": "Электроника всем начинающим",
    "description": "Сегодня мы сделаем одно из самых бесполезных устройств из тех, что можно собрать, но как показывает жизнь, лучше сделать что-то, чем не сделать ничего. Тем не менее, в защиту этой бесполезности можно сказать только что-то вроде: много ли интересных дел, которыми мы занимаемся являются хоть сколько бы полезными?",
    "link": ["https://habr.com/ru/post/593421/", "Читать на Хабр"],
    "tags": ["Электроника", "Хабр", "Arduino", "С++"]
  },
  {
    "image": "/api/images/afe1fe3a5f6c8513b438ad5f4027b503.png",
    "title": "Публикуем полезное расширение для Хабр Фриланса",
    "description": "Это вторая часть, продолжающая серию статей про связанных с разработкой расширения для фрилансеров. С первой статьей, где мы занимаемся разработкой расширения, вы можете ознакомиться здесь. Также найти весь исходный код на GitHub и само расширение в Chrome Web Store. В этой статье я расскажу, как опубликовать расширение в Chrome Web Store. С наступающим Фрилансер. Будь сильней, быстрей, выше.",
    "link": ["https://habr.com/ru/post/596417/", "Читать на Хабр"],
    "tags": ["Хабр", "Chrome Extensions", "JavaScript"]
  },
  {
    "image": "/api/images/78561752448514e8cf1f3fafd2234c64.png",
    "title": "Хабр, не делай больно писателям",
    "description": "Сегодня я расскажу о том как писатели хабра теряют свои статьи из за ошибок в работе редактора Хабра. Мне бы очень хотелось чтобы разработчики Habr или Chromium услышали меня и исправили эту проблему как можно скорее.",
    "link": ["https://habr.com/ru/post/596155/", "Читать на Хабр"],
    "tags": ["Другое", "Хабр"]
  },
  {
    "image": "/api/images/2b10724480d20d6c6dd6f72b08170443.jpg",
    "title": "Создаем полезное расширение для Хабр Фриланса",
    "description": "Сегодня сделаем расширение для фрилансеров очень хорошей биржи Хабр Фриланс, я там сам работал еще в 2018 году, тогда сайт назывался еще Фрилансим.",
    "link": ["https://habr.com/ru/post/592967/", "Читать на Хабр"],
    "tags": ["Хабр", "Chrome Extensions", "JavaScript"]
  }
]
