[
  {
    "image": "/api/images/ezgif-2-3743d6a715.gif",
    "title": "Покатаем",
    "type": "сайт, приложение",
    "html": [
      ["h1", "Покатаем"],
      ["p", "Цель этого сервиса или даже социальной сети, объединить людей на фоне интереса <b>к активному отдыху</b>, он будет решать сразу <b>две задачи</b>. Первую основную это <b>организовать комманду</b> и скажем провести «заезд на горных мотоциклах» мотоциклисты скажем так сталкиваются с такой проблемой и побочную но такую же важную задачу как <b>знакомства</b> и ничего не может быть лучше чем знакомство людей объединенных чем-то конкретным."],
      ["img", "/api/images/ezgif-2-3743d6a715.gif", "Покатаем"],
      ["h2", "История"],
      ["p", "Эту идею который я придумал когда купил <b>мотоцикл</b> в городе в который недавно переехал и <b>не нашел с кем покататься</b>, тогда я почувствовал что <b>есть эта проблема</b> и даже провел опрос на этот счет. По итогам опроса я решил что нужна <b>своя инфраструктура мотоциклистам</b>, позже когда я все таки нашел маленькую группу в whats app, через человека которого нашел в группе вк, мне показалось это очень <b>не простыми шагами</b>."],
      ["img", "/api/images/ezgif-2-05b23088e0.gif", "Покатаем"],
      ["h2", "Общественное мнение"],
      ["p", "Я провел скромный опрос среди мотоциклистов разных городах и еще раз убедился что такой сервис нужен. Как показал опрос <b>людям не с кем «покатать»</b>."],
      ["img", "/api/images/ezgif-2-42d066d1e4.gif", "Покатаем"],
      ["h2", "Философия"],
      ["p", "Есть много разных сервисов для знакомств и все они как-то не идут ни к чему толком, <b>цели нет</b>, доказать я могу это тем что всегда в подобных сервисах существуют кнопки по типу: «Не определился(ась)» или «Пока не знаю» — с точки зрения <s>банальной эрудиции</s> прагматичности это чушь и бред, тут нет никакого пути и цели, ну и по сути эти сервисы бессмысленны совсем. <b>А вот мы то, мы</b> сделаем не просто ритуал знакомств завязанных на свайпах и бесцельном времяпровождении, а конкретно будем сталкивать людей к друг другу на встречу, на «просто прогулку» или соревнования. Каждый кто будет использовать этот сервис будет понимать зачем он туда пришел еще в процессе регистрации и нам не предется заполнять не нужное поле в базе «Для чего вы хотите познакомиться ?»."],
      ["img", "/api/images/ezgif-2-e8da9ed4c9.gif", "Покатаем"],
      ["h2", "Финал ?"],
      ["p", "Я решил что нужно разработать этот сервис и начал этим заниматься, а дальше я вовсе понял что такая проблем есть у всех кто занимается активными видами спорта, решил адаптировать его под большенство разных видов спорта. Но в итоге так его и не закончил <b>у меня сломался жесткий диск</b>, а я не коммитил и потерял почти все наработки. Когда-нибудь планирую им заняться снова, свяжитесь со <a href='https://t.me/prohetamine'>мной</a> если готовы профинансировать или содействовать разработке."],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "Для всех", "Не готово", "StartUp", "Мечта", "React"]
  },
  {
    "image": "/api/images/sdfdgfhkjgdsjsdkfsdjkf.png",
    "title": "Fishing",
    "type": "расширение",
    "html": [
      ["h1", "Fishing"],
      ["p", "Проблема фишинга одна из самых широких в сфере «хакинга» (Если это вообще можно называть хакингом). По моему мнению с этим можно активно бороться и победить."],
      ["q", "Я запрещаю вам фишинг."],
      ["img", "/api/images/sdfdgfhkjgdsjsdkfsdjkf.png", "Fishing"],
      ["h2", "История"],
      ["p", "Я практически никогда не сталкивался с <b>фишингом</b> в интернете, но один раз все же столкнулся совсем не давно, друг прислал мне ссылку на фишинговый сайт, так вот я перешел на него и понял что это фишинг, такая уж особенность у программистов - <b>чувствовать</b>, я почувствовал что, что-то не так и я раньше видел уже подобное в виде спама, но не обращал внимание, а в этот раз зашел для прикола. После этого <s>я придумал концепцию изменения мира</s>, как уничтожить весь фишинг в интернете, я знаю как это сделать, свяжитесь со <a href='https://t.me/prohetamine'>мной</a> если <b>вам это интересно</b> и <b>давайте работать вместе</b>, к слову об этом не давно я заходил на OpenSea и там прям на главной странице было написано: <i>Ребята берегите себя, кто-то использует фишинг</i>. Ну и в целом далеко не секрет что один <b>известный</b> зелененький сайт в Русском сигменте занимается продажей логов и аккаунтов невнимательных людей."],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "Для всех", "Мечта", "StartUp", "Не готово"]
  },
  {
    "image": "/api/images/sdfgdhfjgghfgdvscdads.png",
    "title": "AntiStream",
    "type": "софт",
    "html": [
      ["h1", "AntiStream"],
      ["p", "Не так давно у меня повилась идея отказаться от <b>стриминговых сервисов</b> и я создал свой, его пока нет общем доступе но когда я его оформлю, каждый сможет запустить свою трансляцию, мы тестировали то что я сделал на вебкам модели и в принципе все работало прямо через OBS."],
      ["img", "/api/images/sdfgdhfjgghfgdvscdads.png", "AntiStream — Логотип"],
      ["h2", "Как это будет"],
      ["p", "Скорее всего интерфейс будет состоять из подключаемых и настраиваемых <b>плагинов</b> которые можно будет самостоятельно реализовать и подключить ну и как-то конфигурировать на странице, напиример такие как: <b>чат</b>, <b>iframe виджет</b>, <b>описание</b> или какой-то <b>донат сервис</b>."],
      ["img", "/api/images/adfsgdhfjghfgdfds.png", "AntiStream"],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Не готово", "Мечта", "Для всех"]
  },
  {
    "image": "/api/images/sdguierigeojrgerugier.png",
    "title": "BitHelp",
    "type": "сайт, мобильное приложение",
    "html": [
      ["h1", "BitHelp"],
      ["p", "Этот сервис я придумал когда буквально <b>умирал</b>, лол, как бы это странно не казалось. Суть этого сервиса <b>спасать людей</b>, я могу больше сказать, упрощенная схема этой идеи уже спасла меня — значит работает ?"],
      ["h2", "Суть"],
      ["q", "<b>Люди</b> — это скорая."],
      ["p", "Никто из нас не откажет человеку умирающему на улице, а если таких людей все же большенство, нужно сказать тем кому не безразлично, а сделать это можно будет через мой <b>софт</b>."],
      ["img", "/api/images/sdguierigeojrgerugier.png", "BitHelp — Логотип"],
      ["h2", "Презентация"],
      ["p", "Я предлагал свою идею многим компаниям которые могли бы получить свою <b>выгоду</b> но также и помочь людям."],
      ["img", "/api/images/sdfdghfjgfddssfdgr.png", "BitHelp"],
      ["img", "/api/images/sdfgfnhfgdsdfdgfsddhgs.png", "BitHelp"],
      ["img", "/api/images/sdfgdfdsdhwtfadsbfhrwtegsfh.png", "BitHelp"],
      ["h2", "Моя история как я умер"],
      ["p", "Все вполне банально, <b>встал со стула - начал задыхаться</b>. На тот момент когда я уже понял что все серьезней чем я думал, я не имел телефона и вообще никакой возможности ни дойти до больницы не вызвать скорую, в тоже время у меня был интернет и хоть чисто технически сделать звонок я не мог, я мог попросить из своих друзей вызвать мне скорую, так я и сделал. Да <b>мне вызвали скорую</b>, не смотря на то что я живу буквально <b>в 15 минутах</b> уверенного шага от больницы скорая <b>так и не приехала</b>, а тем временем уже <b>второй час я задыхался</b> и с каждой минутой мне это давалось все сложней.."],
      ["p", "Спустя некоторое время к тому что я задыхаюсь добавлись еще самые разные боли и я уже чуть ли не теряя сознание попросил вызвать мне такси, можно считать что тут был <b>хепиенд</b> и это действительно был он но история этим не кончается, все таки я сел в такси и мы <b>за 5 минут</b> доехали до больницы. Тем временем на часах уже было в районе <b>6 часов</b>. Там врачи сделали свое дело и я оказался жив. Лол."],
      ["p", "Возвращаясь домой по длинной улице <b>мимо меня проехала скорая</b>, сначала я решил что это просто совпадение и ничего не обычного в этом нет, но когда я понял что <b>скорая поворачивает в мой двор</b>, я решил посмотреть снова на часы, а там уже было <b>10 часов вечера</b>. Подходя к дому я окончательно убедился что это ко мне. Жалкая картина, очень жалкая.. Я подошел к водителю скорой и спросил в мою ли квартиру им надо, очевидно что да, а на пороге стояли два медика и просто умиротворенно ждали, поэтому картина то и жалкая, стояли только и всего. Я подошел к ним и сказал что уже вернулся, был отруган за то что <b>не перезвонил и не сообщил что ко мне ехать уже не надо</b> и отругал сам за то что чуть не умер. Лол."],
      ["p", "Так и появилась эта идея."],
      ["h2", "Поддержка"],
      ["p", "Свяжитесь со <a href='https://t.me/prohetamine'>мной</a> если готовы профинансировать или содействовать разработке."]
    ],
    "tags": ["Для всех", "Мечта", "StartUp", "Не готово"]
  },
  {
    "image": "/api/images/5c52ef74eaa840658515fa6a486fcb3d.gif",
    "title": "Narod Mask",
    "type": "сайт",
    "html": [
      ["h1", "Narod Mask"],
      ["p", "Это будет сервис с масками от народа как в <b>instagram</b> или типа того, повторить <b>Spark AR</b> или <b>Lensstudio</b> мне конечно будет не так просто поэтому я так заморачиваться не собираюсь, да и толку от этого не будет в таком случае, эти программы слишком сложные. Это будет просто и удобно. Ты просто сохраняешь шаблон или выбираешь уже имеющуюся маску, может быть редактируешь её прямо на сайте, а потом можешь снимать себя или фотографировать."],
      ["img", "/api/images/5c52ef74eaa840658515fa6a486fcb3d.gif", "Narod Mask — Логотип"],
      ["h2", "Демо"],
      ["p", "Я сделал пробный вариант и отрисовал его в фотошопе в своем неповторимом стиле, врядли такую маску пропустят в <b>instagram</b> или <b>snapchat</b>, но в тоже время я могу ее заменить на любую другую маску и это круто. Пробу пера можно посмотреть в моем <a href='https://www.tiktok.com/@prohetamine/video/7040880781274713346?is_copy_url=1&is_from_webapp=v1&lang=ru-RU'>TikTok</a>."],
      ["q", "Я могу ее заменить на любую другую маску и это круто."],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["For fun", "Для всех", "Не готово", "JavaScript", "VR"]
  },
  {
    "image": "/api/images/fsdgfhgjkjfdsfsdfsdfs.gif",
    "title": "Throwdick",
    "type": "сайт, приложение",
    "html": [
      ["h1", "Throwdick"],
      ["q", "Ты плохой — я накидаю тебе хуев"],
      ["p", "Концепция этого сервиса под лозунгом «Если я такой плохой — зафиксируй это» или иначе это могло бы звучать так «<u>Ты плохой — я накидаю тебе хуев</u>» вообщем любая активность — это хорошо, мое личное отношение к хейту. Я более чем уверен что у всех есть хейтеры среди коллег или не давних друзей, просто знакомых или же подписчиков."],
      ["img", "/api/images/fsdgfhgjkjfdsfsdfsdfs.gif", "Throwdick"],
      ["h2", "История"],
      ["p", "У меня лично есть хейтеры или во всяком времени <b>были</b> до недавнего времени и в один день мне прислали (не хейтеры) одну очень интересную <a href='/api/images/ezgif-5-a840c19344.gif'>гифку</a> и я подумал, почему бы мне не сделать сервис для хейров ? <b>Они что не люди ?</b> Пусть выскажутся пусть сделают <b>throw dick</b> (кинут в меня хуй) так и появится этот сервис, зарегистрироваться или зарегистрировать кого-то там было очень просто, достаточно было добавить только username пользователя <b>telegram</b>."],
      ["h2", "Где это чудо ?"],
      ["p", "Сейчас сервис <b>не работает</b>, не помню уже в связи с чем я его не запустил полностью, мы потестили, люди оценили даже очень. Скорее всего потому что домен не купил. Но думаю запущу когда в этом будет необходимость и возможность."],
      ["h2", "Особенности сервиса"],
      ["p", "В связи с этим сервисом родился модуль <a href='/project/N'>react-router-dom-animation</a>."],
      ["h2", "Поддержка"],
      ["p", "Кинуть денег, а не хуев если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "For fun", "Для всех", "Готово", "JavaScript", "React"]
  },
  {
    "image": "/api/images/fdernguiergnergiergnergnergnie.jpg",
    "title": "MEX STUDIO",
    "type": "сайт, приложение",
    "html": [
      ["h1", "MEX STUDIO"],
      ["p", "Этот проект про вебкам из той же истории что и <a href='/service/voltica'>Voltica</a> но он был первый и наверно первый раз связал меня с вебкамом в принципе."],
      ["q", "<b>MEX STUDIO</b> — пришел победить уродство ботов на сайтах."],
      ["p", "И принес новые идеи такие как <b>рулетка</b> и <b>Text Speecher</b>, но опять же ставил очень большие и грандиозные цели, но не получил поддержки и был слит."],
      ["img", "/api/images/fdernguiergnergiergnergnergnie.jpg", "MEX STUDIO — Логотип"],
      ["h2", "История"],
      ["p", "История этого проекта самая впечатляющая из всех, он буквально выстрадан и о нем очень <b>тяжко</b> рассказывать, но как-нибудь я запишу <a href='/#history'>историю</a> про то как он создавался в голосовом формате."],
      ["img", "/api/images/fowiefnwefwenfwnefoweif.jpg", "MEX STUDIO"],
      ["h2", "Предпосылки"],
      ["p", "Конечно не случилось это просто так, всему виной <b>банальное начало</b> коронавируса, да да начался коронавирус и <b>я ушел на вебкам</b> — звучит забавно, но отчасти так и есть. Я искал идеи в которые можно вписаться так как потерял почти всех своих клиентов, вебкам показался мне достаточно интересной игрушкой где много денег и вопрос оказался только в том <b>как конвертировать свои знания в монеты</b>."],
      ["img", "/api/images/ezgif-4-555f95d28dd.gif", "MEX STUDIO"],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "Деньги", "StartUp", "Вэбкам", "Готово", "JavaScript"]
  },
  {
    "image": "/api/images/gerergef23r23fefwefefwefewf.png",
    "title": "Nopress",
    "type": "сайт",
    "html": [
      ["h1", "Nopress"],
      ["p", "Этот сервис будет <b>коллективным блогом</b> в котором я соберу <b>профессионалов</b> в большенстве своем среди друзей в которых я уверен и мы будем писать о своих спецефичных и не очень занятиях, <b>статьи</b> и <b>туториалы</b>, кто-то про программирование и электронику, а кто-то про эмиграцию и криминалистику, и конечно еще много других тем, единственное чего мы не будем касаться это <b>политоту</b> и другие особо <b>острые темы</b>."],
      ["img", "/api/images/gerergef23r23fefwefefwefewf.png", "Nopress — Логотип"],
      ["h2", "История"],
      ["p", "Я решил что когда-нибудь создам коллективный блог для себя и друзей чтобы писать <b>профессиональный материал</b>, так уж сложилось что концентрация талантливых и разноплановых людей вокруг меня стала слишком большой и идея оказалась достаточно популярной."],
      ["h2", "Предпосылки"],
      ["p", "В последнее время <b>я прозрел</b> и погрузился в себя далеко и надолго, я переоценил некоторые паттерны своих идей программирования, основной тезис — <b>писать для себя</b>. Я хочу писать свои сервисы, софт, сайты, приложения и что-либо еще, а что я разве не пишу свои модули, свой софт ? Нет дело не в этом, дело в том что я хочу писать для себя, <b>я хочу свою инфраструктуру</b>, свои приложения и другие свои приколюхи, в этом вся идея, может быть в этом как-то проявляется нарцисизм, но я воспринимаю это скорее как рост. Поэтому в последнее время <b>я взял курс на внутренние сервисы</b>, я буду уделять больше времени тому чем сам пользуюсь не смотря на то что придется отказаться от ништяков с фриланса."],
      ["h2", "Предпосылки 2"],
      ["p", "Наверно это естественный путь развития компании, а <b>не разработчика</b>, я имею ввиду обращивать себя со всех сторон разным софтом и сервисами. Но так как <b>я не компания</b> и даже скорее не коммандны игрок <b>я делаю все один</b>, может быть со временем эта история приобретет сторонников, я соберу комманду или вроде того и мы будем работать вместе над проектами. Но проблем тут несколько, основная это то что сам <b>prohetamine</b> — неделим, но это еще пол беды, концепция коммандной работы заключает в себе не только комфортные <b>отношения</b> и <b>интересные задачи</b> но также и <b>финансовую часть</b>, а это уже другая история. Я имел опыт управления коммандой и могу сказать что когда последнее отсутствует очень тяжело договариваться, приходится переходить из такого общего определения как <b>тимлид</b> в человека который скорее должен являться <b>авторитетом</b> нежели управляющим. Пока будет продолжаться так, времени на все не хватает даже если его все полностью уделять своим разработкам и не заниматься финансовыми задачами."],
      ["h2", "Предпосылки 3"],
      ["p", "Далеко не вчера я пришел к этой мысли делать «софт для себя» к этой мысли я пришел уже давно, только <b>не осознавал</b> этого, в этом не было особой цели, <b>все было бесцельно</b>, достаточно было того что это просто интересно, а сейчас рождается что-то достаточно <b>большое</b> чтобы обрести какую-то <b>цель</b> или даже целую <b>философию</b>."],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "Мечта", "Не готово", "Для всех"]
  },
  {
    "image": "/api/images/sfsdfdsg34ge5gerergre.png",
    "title": "QR-map.money",
    "type": "сайт, мобильное приложение",
    "html": [
      ["h1", "QR-map.money"],
      ["p", "Сервис для отслеживания перемещения наличных <b>денег</b> разного наминала и происхождения, по стране или даже миру, ввиде точек на карте."],
      ["img", "/api/images/sfsdfdsg34ge5gerergre.png", "QR-map.money — Логотип"],
      ["h2", "История"],
      ["q", "Было бы клево отслеживать как перемещается твоя купюра по городу, стране или даже странам — <b>я решил разработать такой сервис</b>."],
      ["p", "Идея в том чтобы просто отсканировать купюру и моментально внести ее местоположение в базу данных, но в связи с какими-то обстоятельствами <b>рентабельности</b> всей этой затеи и предполагаемых <b>перспектив</b> я его не запустил в паблик... Хоть и <b>сделал полностью</b> сам сайт. Cервис остался только идей, только ветренной мечтой."],
      ["img", "/api/images/asdasasdadfr23fewf.png", "QR-map.money - Сайт"],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "For fun", "Для всех", "Идея", "Готово", "JavaScript", "React"]
  },
  {
    "image": "/api/images/csdksdkjvdsvsdjvsdkvbsjkv.png",
    "title": "расширение Habr Freelance",
    "type": "расширение",
    "html": [
      ["h1", "Habr Freelance"],
      ["q", "Я был как в роли <b>заказчика</b> так и <b>фрилансера</b> и понимаю о чем говорю."],
      ["p", "Ужасно тяжело общаться с фрилансерами и заказчиками, которые отвечают по часу. Да и очень не приятно пропускать интересные и клевые задачи, но самое главное кто владеет знанием раньше тот в более выигрышном положении это расширение призванно <b>держать руку на пульсе</b> пока вы просто занимаетесь своими делами в интернете. Как только заказчик вам ответит, вас пригласят обсудить задачу или кто-то добавит новый заказ в подходящую категорию вы <b>мгновенно</b> получите уведомление."],
      ["img", "/api/images/csdksdkjvdsvsdjvsdkvbsjkv.png", "Habr Freelance - расширение для Google Chrome"],
      ["h2", "Ресурсы сервиса"],
      ["p", "Исходный код: <a href='https://github.com/prohetamine/habr-freelance'>GitHub</a>"],
      ["p", "Скачать в официальном магазине расширений: <a href='https://github.com/prohetamine/habr-freelance'>Chrome Web Store</a>"],
      ["h2", "История"],
      ["p", "Это расширение было разработано первый раз еще в <b>2018 году</b>, опубликовал и даже получил небольшой презент в <b>500 кредитов</b> от администраторов/разработчиков сайта, но потом я его удалил как и много всего остального, так уж вышло. Сейчас в <b>2021 году</b> я возобновил эту идею снова в новом воплощение еще и несколько статей принес о том как разрабатывать расширения для Google Chrome и причины для создания этой штуки были все теже что и в <b>2018 году</b>. Подробно можно почитать в первой статье ниже по ссылкам."],
      ["img", "/api/images/efiowfnoefwnowefnewfo.png", "Habr Freelance - расширение для Google Chrome"],
      ["h2", "Читать"],
      ["p", "Первая часть статьи о разработке расширения: <a href='https://habr.com/ru/post/592967/'>Хабр</a>"],
      ["img", "/api/images/2b10724480d20d6c6dd6f72b08170443.jpg", "Habr Freelance - расширение для Google Chrome"],
      ["p", "Вторая часть статьи о публикации расширения в Chome Web Store: <a href='https://habr.com/ru/post/596417/'>Хабр</a>"],
      ["img", "/api/images/afe1fe3a5f6c8513b438ad5f4027b503.png", "Habr Freelance - расширение для Google Chrome"],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "Работа", "Деньги", "Для всех", "Готово", "JavaScript", "Chrome extension"]
  },
  {
    "image": "/api/images/dsjfkhgweofinkjds.jpg",
    "title": "JS.VPN-Client",
    "type": "приложение",
    "html": [
      ["h1", "JS.VPN-Client"],
      ["p", "Этот <b>VPN</b> клиент был разработан во времена жалких попыток Роскомнадзора заблокировать Телеграм, как можно видеть он даже стилизован соответственно. Сейчас на момент <b>2022 года</b> который безусловно нам снова запомнится <u><b>ужасными преступлениями против человечества</b></u> и уже <b>массовыми блокировками</b>, не исключено что проект переживет реинкарнацию."],
      ["img", "/api/images/pzjhufgsgxcey5zbgfcg7vulblk.gif", "JS.VPN-Client"],
      ["h2", "История"],
      ["p", "В <b>2018 году</b> в России активно пытались заблокировать мой любимый мессенджер в котором я сижу с самого <b>2016 года</b>. И так как я очень люблю свободный интернет и собственно телеграм, я решил что было бы не плохо разработать свой <b>VPN</b> клиент в поддержку протеста против блокировок телеграма, существовало две версии приложения, последняя была разработана в конце <b>2018 года</b>, а первая в начале прямо в моменты блокировок. C того момента я больше им не занимался, исходный код можно по прежнему найти в <a href='https://github.com/prohetamine/JS.VPN-Client'>GitHub</a> и запустить но приложения готовые к пуску собраны только для Windows."],
      ["img", "/api/images/sfnsdjbsdjgbsdkfjjsdf.jpg", "JS.VPN-Client"],
      ["h2", "Особенности сервиса"],
      ["p", "Это был мой первый опыт с <b>Electron</b> и <b>OpenVPN</b>, что касается <b>Electron</b> я даже придумал некоторую методологию разработки приложений, все это было описано в <b>13 частях</b> статьи по разработке собственного <b>VPN</b> клиента на <b>JavaScript</b>."],
      ["img", "/api/images/dsjfkhgweofinkjds.jpg", "JS.VPN-Client"],
      ["h2", "Конец"],
      ["p", "Телеграм разблокировали и я по прежнему его люблю, а все свои статьи я просто удалил, но там уже другая история... Правда их все еще можно найти на просторах интернета в качестве копий."],
      ["img", "/api/images/sdfjdsljdsjfklsdfjsdfksdjnvs.jpg", "JS.VPN-Client"],
      ["h2", "Поддержка"],
      ["p", "Мне можно задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "Для всех", "Готово", "JavaScript", "OpenVPN", "Electron", "NodeJS"]
  },
  {
    "image": "/api/images/dsfgudihfjdrungjkfdgjidofgn.jpg",
    "title": "Voltica",
    "type": "сайт, приложение",
    "html": [
      ["h1", "Voltica"],
      ["p", "Этот предназначался как <b>супер-крутой</b> сервис для вебкам моделей, планировалось что это будет платформой с всякими крутыми интерактивными шутками. Например такими как: Сбор информации о всех зрителях, вычисление их характера и потребностей, предпочтений и других паттернов для построения коммункции - это был бы прекрасный передовой инструмент для отжимания бабок (<b>Lovense</b> приступай к регистрации патента), по мимо этого мы планировали использовать машинное обучение для распознавания образов."],
      ["q", "<b>Lovense</b> — запантентовал то что не является в широком смысле изобретением, ничего неординарного и выдающегося нет в том чтобы читать чат."],
      ["p", "И наверно самая глобальная задача которую мы могли бы решить удержавшись в онлайн секс индустри это предоставить свободным разработчикам и производителям секс игрушек и всем желающим доступ к общему <b>API</b> чатов всех сайтов, это дало бы возможность <b>уничтожить монаполию</b> на чтение чата так называемого <b>Lovense</b> хотя бы в Русском сегменте, я уже далеко не первый раз слышу историю о том что <b>Lovense</b> что-то там запатантовал, но это просто <a href='https://www.youtube.com/watch?v=FKBlnd9CjIk'>смешно</a>. Мы собирались сделать красиво, а вы не дали денег, так что сидите в заточении."],
      ["img", "/api/images/dsfgudihfjdrungjkfdgjidofgn.jpg", "Voltica — Логотип"],
      ["h2", "Особенности сервиса"],
      ["p", "Мы сделали <b>сайт маркетплейс</b> и <b>бота</b> в телерам для авторизации и регистрации которая у нас была не совсем обычной - она проходила только через телеграм бота. Так же первое и как оказалось единственное прикольное приложение для <b>OBS</b> которое мы придумали и я разработал оказался <b>переводчик-экранный диктор</b> в режиме реального времени голоса стримера, его задача была выводить в <b>OBS</b> переведенный текст прямо на стрим в небольшом окошке, также мной было разработано расширение для chrome для отправки переведенного текста во все чаты стримера, на таких сайтах как: <b>chaturbate</b>, <b>bongacams</b>, <b>stripchat</b>, <b>myfreecams</b> - как автоматически так и с возможностью контроля <b>авто отправки</b>."],
      ["img", "/api/images/asdjkasdjkasldasdj.png", "Voltica переводчик — Clidia"],
      ["h2", "Предпосылки и конец"],
      ["p", "Вообщем то уже <a href='/service/mex-studio'>не первый раз</a> связываясь в вебкамщицами я оказываюсь у разбитого корыта, у меня снова были большие планы я хотел принести развитие на вебкам и конечно заработать. Но вебкамщицы и студии опять все всрали своим безразличием к развитию индустрии что вообщем-то не удивительно."],
      ["img", "/api/images/asdlkjfsgdsjalfdhjkgfahasasfgkaskg.png", "Voltica, конец — 404"],
      ["h2", "Поддержка"],
      ["p", "Если вдруг ты <b>слишком благодарная вебкамщица</b>, у тебя есть возможность поддержать деревянным мою деятельность: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>, по всей видимости с вебкамом в своей жизни я еще ни раз столкнусь как бы мне этого не хотелось."]
    ],
    "tags": ["Деньги", "Вэбкам", "Готово", "JavaScript", "React", "NodeJS"]
  },
  {
    "image": "/api/images/dfdsfsdfsdfsdfsdfsdfsdf.png",
    "title": "Radio.Boomer FM",
    "type": "сайт",
    "html": [
      ["h1", "Radio.Boomer FM"],
      ["p", "Мое онлайн радио на котором я планирую вести эфиры пару раз в неделю. В данный момент <strike>не работает в связи с отстутствием сервера..</strike> Но как только он появится послушать радио можно будет тут: <a href='https://prohetamine.github.io/radio-boomer/'>Radio.Boomer FM</a>"],
      ["img", "/api/images/dfdsfsdfsdfsdfsdfsdfsdf.png", "Radio.Boomer FM — Онлайн радио станция на JavaScript"],
      ["h2", "Особенности сервиса"],
      ["p", "Ядро ака модуль разработан также мной и опубликованная в свободном доступе для запуска всеми желающими, сам модуль радио станции состоит <b>98.2%</b> из <b>JavaScript</b> Все модули можно найти на моих ресурсах: <a href='https://github.com/prohetamine/radio-station'>github/radio-station</a>, <a href='https://www.npmjs.com/package/radio-station'>npm/radio-station</a>, <a href='https://hub.docker.com/repository/docker/prohetamine/docker-launcher-web-radio'>docker</a>"],
      ["img", "/api/images/asdljkafshfjgsldkfasasdlasfhkas.png", "radio-station"],
      ["h2", "История"],
      ["p", "У каждого моего проекта безусловно должна быть история."],
      ["q", "<b>Онлайн радио</b> — это мой каприз который перерос в множество модулей."],
      ["p", "И так: Дело было 31 декабря в голосовом телеграм чате я разговаривал с людьми, обсуждались разные темы и где-то в воздухе постоянно <selection>витала шиза</selection>, которую я безусловно подогревал и даже нагнетал, в один момент это зашло слишком далеко и я решил что было бы не плохо отыграть в этом театре роль радиоведущего, я представился радиоведущим, зачем и для чего история умалчивает, но уверяю публика оценила и получилось весьма весело, а на следующий день я решил что буду радиоведущим <b>на самом деле</b>. Я начал разбираться как запустить свое онлайн радио на существующих технологиях, но когда я понял как это сложно, <b>я разочаровался в этом мире</b> и решил что у меня должно быть свое онлайн радио, самое лучшее и удобное, <b>радио для людей</b> так сказать, а вот получилось у меня или нет еще нужно провериять, как только я обзаведусь сервером я запущу свое онлайн радио!"],
      ["h2", "Предпосылки"],
      ["p", "Я нашел на мусорке музыкальный центр <b>Panasonic SC-PM27</b> очень клево что он заработал, для устройсва <b>~2002 года</b> спустя практически 20 лет это безусловно супер классно, вообще все что я находи подобным образом работало (я мало находил). Некоторое время я с ним поигрался, отличная штука, увы дисковод оказался поврежден и его пришлось отменить."],
      ["q", "Как можно заметить интерфейс моего радио также отсылает к этой истории."],
      ["img", "/api/images/sadsdjkafneqiofn21o3.jpg", "Я нашел на мусорке музыкальный центр Panasonic SC-PM27 и сделал свое онлайн радио"],
      ["h2", "Предпосылки 2"],
      ["p", "Я никогда <b>не любил</b> особо ни музыку ни тем более радио, но в один день полюбил и начал любить, а в итоге я завел телеграм канал для себя чтобы там собирать шедевры прошлого десятилетия с музыкой <b>2000-2010 годов</b>, это явилось еще одним поводом чтобы быть моей радиостанции, её я и буду транслировать также на своем радио."],
      ["h2", "День радио"],
      ["p", "Наконец-то это случилось, сегодня <b>5 апреля 2022 года</b> радио заиграло на коротких и длинных частотах. Что называется этот день мы приближали как могли, да будет радио! <a href='https://prohetamine.github.io/radio-boomer/'>Radio.Boomer FM</a>"],
      ["h2", "Эфиры"],
      ["p", "Когда и о чем будут эфиры пока сказать сложно, на данный момент там будет играть музыка. Но как только предстоит какой-то анонс я сообщу о нем в <a href='/#social'>соц сетях</a> и <a href='/lenta#radio-ether'>ленте новостей</a>."],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "Для всех", "Готово", "JavaScript", "React", "NodeJS"]
  },
  {
    "image": "/api/images/dfsgdhfju6y5teweacdsdsf.png",
    "title": "Emoji Art",
    "type": "сайт",
    "html": [
      ["h1", "Emoji Art"],
      ["p", "Представляю новый вид искуства — рисование картинки из Emoji, но как позже оказалось это совсем не что-то новое, тем неменее... я это сделал!"],
      ["img", "/api/images/dfsgdhfju6y5teweacdsdsf.png", "Emoji-Art — новое искусство, изображения из эмодзи"],
      ["p", "Отрендерить свою картинку можно тут: <a href='https://prohetamine.github.io/emoji-art/?site'>Emoji Art</a>"],
      ["h2", "Пример"],
      ["p", "Так выглядит отрендеренная картинка <b>до</b> и <b>после</b>:"],
      ["img", "/api/images/asdkjasdjasdbasdjbasd.jpg", "Emoji-Art — новое искусство, изображения из эмодзи"],
      ["h2", "Версия для обработки видео"],
      ["p", "Не знаю почему, но многим людям <b>нравится и интересно</b>, поэтому когда-нибудь появится версия для рендеринга видео и каждый сможет сделать <b>фильм из emoji</b> как это сделал я его можно найти в у меня в <a href='https://www.tiktok.com/@prohetamine'>TikTok</a>"],
      ["img", "/api/images/sfskdfsngunewui3nf2k3.webp", "Emoji-Art — новое искусство, изображения из эмодзи"],
      ["h2", "История"],
      ["p", "Этот проект родился когда я ехал в <b>поезде</b> и пытался сделать его с <b>телефона</b> в песочнице и в тоже время под <b>запись</b> (я понимаю как это дико звучит). В тот момент у меня не особо удалось сделать (приложение в котором я программировал вылетало), я пытался как минимум <b>3</b> раза, но уж очень тяжело оказалось выделить доминирующие цвета с <b>3000+</b> emoji ¯\\_(ツ)_/¯"],
      ["img", "/api/images/sfskdfsngunewui3nf2k31.png", "Emoji-Art — новое искусство, изображения из эмодзи"],
      ["h2", "Поддержка"],
      ["p", "Задонатить если нравится идея или сервис можно тут: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["Своя история", "For fun", "Для всех", "Готово", "JavaScript", "Canvas", "React"]
  },
  {
    "image": "/api/images/adsfghjhtergergergergergre.png",
    "title": "Ifpractic",
    "type": "сайт",
    "html": [
      ["h1", "Ifpractic"],
      ["p", "Сервис для обучения программированию или как можно понять условия с <b>289 раза</b>, я создавал этот сервис для своих учеников."],
      ["q", "<b>Условия</b> — хоть и простая на опытный взгляд профессионала конструкция но в тоже время сложная для новичка в программировании и все же является самой ключевой в программировании на любом языке."],
      ["img", "/api/images/adsfghjhtergergergergergre.png", "Ifpractic — Сервис для обучения условиям"],
      ["p", "Может быть когда-то я проведу за руку по каждой ключевой конструкции таким же образом и мы сделаем мир лучше, любой человек может поучаствовать в жизни проекта так как он находится на <a href='https://github.com/prohetamine/ifpractic'>GitHub</a> и доступен для контрибьюта всеми желающими. Также можно сделать добровольное пожертвование для повышения моей мотивации, во всяком случае все равно планирую закончить проект до конца 2022 года."],
      ["img", "/api/images/sdasfgdfhjfgkndsflzjcbvew8w.png", "Ifpractic — Сервис для обучения условиям"],
      ["p", "Но также уже сейчас можно попрактиковаться в изучении условий: <a href='https://github.com/prohetamine/ifpractic'>Ifpractic</a>"],
      ["h2", "Моя история"],
      ["p", "Когда я изучал программирование одной из самых непонятных конструкций были условия, я вспоминаю как во времена учебы еще в колледже делал мемы чтоб их понять."],
      ["q", "<b>Я делал мемы</b> — про условия и публиковал их у себя в вк."],
      ["p", "Cам процесс визуализации или работы с конкретными образами видимо как-то должен был мне помочь их понять, наверно недели две я понимал как они работают даже в самой простой форме, но даже когда я думал что я понял условия, в скрое осознал что я ошибался, даже условия достаточно многогранная конструкция. Полное понимание условий пришло только с глубокой практикой спустя годы."],
      ["img", "/api/images/sdiofugrey7rhsidfunacjskdo.png", "Ifpractic — Сервис для обучения условиям"],
      ["h2", "Поддержка"],
      ["p", "Ты можешь помочь разработке сервиса создавая новые задания: <a href='https://github.com/prohetamine/ifpractic'>GitHub</a> или просто поддержать разработку: <a href='https://www.donationalerts.com/r/prohetamine'>донат</a>."]
    ],
    "tags": ["For fun", "Обучение программированию", "Для всех", "В процессе", "JavaScript", "React"]
  }
]
